app/controllers/cbac/generic_roles_controller.rb

INSERT INTO "cbac_generic_roles" ("name", "remarks", "updated_at", "created_at") VALUES('Fosdem participant', 'Someone who went to Fosdem', '2010-02-06 16:48:26', '2010-02-06 16:48:26')
---
  def create
    @role = Cbac::GenericRole.new(params[:cbac_generic_role])
    @role.save