app/controllers/news_items_controller.rb

  def index
    @news_items = NewsItem.all
---
SELECT * FROM "news_items"

  def show
    @news_item = NewsItem.find(params[:id])
---
SELECT * FROM "news_items" WHERE ("news_items"."id" = 298486374)

  def create
    @news_item = NewsItem.new(params[:news_item])

    respond_to do |format|
      if @news_item.save
---
INSERT INTO "news_items" ("title", "body", "created_at", "updated_at") VALUES(NULL, NULL, '2010-05-10 17:32:53', '2010-05-10 17:32:53')