app/controllers/news_controller.rb

SELECT * FROM "news"
---
  def index
    @news = News.all

SELECT * FROM "news" WHERE ("news"."id" = 298486374)
---
  def show
    @news = News.find(params[:id])

SELECT * FROM "news" WHERE ("news"."id" = 980190962)
---
  def destroy
    @news = News.find(params[:id])